content/seminars/dbcoh/index.org
#+title: Reading Seminar on Fourier Mukai Transforms in Algebraic Geometry
#+date: 2021 Semester 1

We organised our reading and wrote comments on an anonymous collaborative whiteboard (https://www.mathdown.net/?doc=I7X3CpuNsKa#DbCoh).
We used a Google Jamboard and zoom when we met in person (and zoom).

Below is a transcript of the whiteboard.

* Sections 11.1 and 11.2

- 11.1 :: the proof is clumsy. Use $j_*j^*j_*\cal{F}=j_*\cal{O}\otimes j_*\cal{F}=j_*(j^*j_*\cal{O}\otimes F)$ and then apply (i) to prove the second equality in (ii). And for (iii), use $Hom(j_*\cal{O},j_*\cal{F})=j_*Hom(j^*j_*\cal{O},\cal{F})$ coupled with (i).


* Section 10.2, 10.3
1. In Remark 10.8ii, it is mentioned that the corresponding fact for abelian varieties is deeper. What part of the argument of Cor 10.7 breaks down for abelian varieties? Is it integrality of Mukai vectors?

2. It's a bit odd that 10.3 says nothing about why M is a K3.
   (It's derived equivalent to a K3, hence a K3.)

3. In the proof of 10.10, why does $\phi$ induce an isometry on $H^2$ if $\phi(0,0,1) = \pm(0,0,1)$?

4. Proposition 10.24 seems to say, in particular, that every (?) (-2) Mukai vector is the class of a spherical sheaf.

5. The proof of Lemma 10.6 went a bit quickly for me so it would be nice to talk briefly about it.

6. I found the first part of Section 10.3 to be a very readable explanation of coarse and fine moduli spaces. But I got lost in the second part, so I would like to have a discussion about it.

7. Why is the Kahler cone connected?

* Section 10.1
1. Trivial canonical bundle implies first Chern class is zero?

2. Can there be an isomorphism of K3 surfaces (as complex manifolds) which is not algebraic?



* Sections 9.4, 9.5
1. The digression on page 217 is pretty cool. I'd like to discuss it.

2. 

* Sections 9.1, 9.2, 9.3

1. Proof of 9.19: the paragraph at the top of page 202 is superfluous. 

2. 9.20: as stated the closed point $a\in A$ plays no role. Of course one can reverse the roles of $A$ and $\hat A$, tenroing with line bundles on $\hat A$ and translating by points in $A$. 

3. 9.26: Doesn't seem correct. The commutative square giving the fact that $f:B\to A$ is a homomorphism isn't cartesian, hence there is no reason to expect that the base-change map $f^*m_*(\cal{F}\boxtimes\cal{E})\to m_*(f^*\cal{F}\boxtimes f^*\cal{E})$ should be an isomorphism.
  I think it even fails for skypscraper sheaves.

4. Proof of 9.30: the only place where 9.26 is used is in this proof, more specidically in the sequence on equation in the middle of page 208. In this application $f=\varphi_L^{}$ is an isomorphism, in which case there is no problem. The square in 3. is cartesian.

   Also in the proof of 9.30, I was confused for a long time about the proof of commutativity of the square on page 208, but then realised that for an isomorphism, the push-forward is the same as the pull-back by the inverse.

5. Don't get both remark 9.5.

6. Curiosity: what happens to the translation non-invariant line bundles under the FM transform?

7. Can we look at the SL2 action in the case of an elliptic curve?

* Sections 8.4 and 9.1
1. No need to leave out the proof of 8.42, which follows easily from the isomorphism $Hom_X(i_*\cal{E},i_*\cal{E})\cong Hom_Y(i^*i_*\cal{E},\cal{E})$.

2. 8.45: I did find a proof, but it wasn't quite so trivial. If someone has an easier argument it would be great to see it.

3. Don't get both remark 9.5.


* Sections 8.2 and 8.3

2. Proof of lemma 8.21: Why $p_* (q^* \epsilon^\vee \otimes S^\vee \otimes \omega_X [dim(X)] \cong Hom(p_*(q^* \epsilon \otimes S), \mathcal{O}_X)$?

5. I find the following form of 8.28 easier to understand: Every $F \in D^b(X)$ has a filtration $$ 0 = F_0 \to F_1 \to \cdots \to F_n = F$$ whose "subquotients" are $R\pi_*(F(r)) \otimes \Omega^{-r}(-r)$. Likewise, $F$ also admits a filtration whose "subquotients" are $R\pi_* (F \otimes \Omega^{-r}(-r)) \otimes \mathcal O(r)$. 

4. What is the entire section 8.3 doing?

1. 8.30: there's definitely something wrong in the statement, after all the exact sequence $0\to\Omega(1)\to\cal{O}^{n+1}\to\cal{O}(1)\to0$ gives lots of nonzero maps $\Omega(1)\to\cal{O}$. 
    But no maps from $\mathcal O \to \Omega(1)$! So, may be the sequence should be written the other way round?

3. Esercise 8.5 seems very important; can someone go through or say some words on it?

* Week 8: Section 8.1
1. Here is an example of Example 8.17: Let $X$ be a K3 surface. Then $Y = {\rm Hilb}^n X$ (the Hilbert scheme of $n$ points on $X$) is an algebraic symplectic variety of dimension $2n$. Suppose we have a $(-2)$ curve $C \subset X$. Then we have a $\mathbb P^n \cong  {\rm Hilb^n} C \subset Y$. On $X$, we have a spherical twist $D^b(X) \to D^b(X)$ given by $\mathcal O_C$. On $Y$, we have a $\mathbb P^n$-twist $D^b(Y) \to D^b(Y)$ given by $\mathcal O_{{\rm Hilb}^n C}$.
    1. In general, how you obtain this $(-2)$ curve C? 
       In general, there is no such (-2) curve. But some special K3 surfaces may have one. For example, if you move your K3 surface in a family and it acquires a suitable singularity (of type ADE), then its minimal resolution will be a K3 surface that has (-2) curves.

2. Proof of 8.6: The first isomorphism is because $\mathcal{O}_\Delta$defines an equivalence?

3. Lemma 8.12 and its Corollary 8.13 are both interesting. Can anyone give more insight by illustrating a nice example?

4. I don't understand Remark 8.11. Why isn't the inverse given by the adjoint (whose kernel *is* easily described)?

5. I couldn't do Exercise 8.7.

6. I don't understand 8.10ii and 8.10vi

7. In 8.17, why is H*(X,O_X)=H*(P^n) for an algebraic symplectic variety X? 

