docs/seminars/dbcoh/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-04-16 Wed 21:44 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Reading Seminar on Fourier Mukai Transforms in Algebraic Geometry</title>
<meta name="author" content="Anand Deopurkar" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/css/main.css"><link href="https://fonts.googleapis.com/css2?family=Atkinson+Hyperlegible:ital,wght@0,400;0,700;1,400;1,700&family=B612:wght@300..700&display=swap" rel="stylesheet">
</head>
<body>
<div id="content" class="content">
<h1 class="title">Reading Seminar on Fourier Mukai Transforms in Algebraic Geometry</h1>
<p>
We organised our reading and wrote comments on an anonymous collaborative whiteboard (<a href="https://www.mathdown.net/?doc=I7X3CpuNsKa#DbCoh">https://www.mathdown.net/?doc=I7X3CpuNsKa#DbCoh</a>).
We used a Google Jamboard and zoom when we met in person (and zoom).
</p>

<p>
Below is a transcript of the whiteboard.
</p>
<div id="outline-container-org550bef1" class="outline-2">
<h2 id="org550bef1">Sections 11.1 and 11.2</h2>
<div class="outline-text-2" id="text-org550bef1">
<dl class="org-dl">
<dt>11.1</dt><dd>the proof is clumsy. Use \(j_*j^*j_*\cal{F}=j_*\cal{O}\otimes j_*\cal{F}=j_*(j^*j_*\cal{O}\otimes F)\) and then apply (i) to prove the second equality in (ii). And for (iii), use \(Hom(j_*\cal{O},j_*\cal{F})=j_*Hom(j^*j_*\cal{O},\cal{F})\) coupled with (i).</dd>
</dl>
</div>
</div>
<div id="outline-container-orge6f9e1b" class="outline-2">
<h2 id="orge6f9e1b">Section 10.2, 10.3</h2>
<div class="outline-text-2" id="text-orge6f9e1b">
<ol class="org-ol">
<li>In Remark 10.8ii, it is mentioned that the corresponding fact for abelian varieties is deeper. What part of the argument of Cor 10.7 breaks down for abelian varieties? Is it integrality of Mukai vectors?</li>

<li>It&rsquo;s a bit odd that 10.3 says nothing about why M is a K3.
(It&rsquo;s derived equivalent to a K3, hence a K3.)</li>

<li>In the proof of 10.10, why does \(\phi\) induce an isometry on \(H^2\) if \(\phi(0,0,1) = \pm(0,0,1)\)?</li>

<li>Proposition 10.24 seems to say, in particular, that every (?) (-2) Mukai vector is the class of a spherical sheaf.</li>

<li>The proof of Lemma 10.6 went a bit quickly for me so it would be nice to talk briefly about it.</li>

<li>I found the first part of Section 10.3 to be a very readable explanation of coarse and fine moduli spaces. But I got lost in the second part, so I would like to have a discussion about it.</li>

<li>Why is the Kahler cone connected?</li>
</ol>
</div>
</div>
<div id="outline-container-org1c52b28" class="outline-2">
<h2 id="org1c52b28">Section 10.1</h2>
<div class="outline-text-2" id="text-org1c52b28">
<ol class="org-ol">
<li>Trivial canonical bundle implies first Chern class is zero?</li>

<li>Can there be an isomorphism of K3 surfaces (as complex manifolds) which is not algebraic?</li>
</ol>
</div>
</div>
<div id="outline-container-org1002d8c" class="outline-2">
<h2 id="org1002d8c">Sections 9.4, 9.5</h2>
<div class="outline-text-2" id="text-org1002d8c">
<ol class="org-ol">
<li>The digression on page 217 is pretty cool. I&rsquo;d like to discuss it.</li>

<li></li>
</ol>
</div>
</div>
<div id="outline-container-org87691de" class="outline-2">
<h2 id="org87691de">Sections 9.1, 9.2, 9.3</h2>
<div class="outline-text-2" id="text-org87691de">
<ol class="org-ol">
<li>Proof of 9.19: the paragraph at the top of page 202 is superfluous.</li>

<li>9.20: as stated the closed point \(a\in A\) plays no role. Of course one can reverse the roles of \(A\) and \(\hat A\), tenroing with line bundles on \(\hat A\) and translating by points in \(A\).</li>

<li>9.26: Doesn&rsquo;t seem correct. The commutative square giving the fact that \(f:B\to A\) is a homomorphism isn&rsquo;t cartesian, hence there is no reason to expect that the base-change map \(f^*m_*(\cal{F}\boxtimes\cal{E})\to m_*(f^*\cal{F}\boxtimes f^*\cal{E})\) should be an isomorphism.
I think it even fails for skypscraper sheaves.</li>

<li><p>
Proof of 9.30: the only place where 9.26 is used is in this proof, more specidically in the sequence on equation in the middle of page 208. In this application \(f=\varphi_L^{}\) is an isomorphism, in which case there is no problem. The square in 3. is cartesian.
</p>

<p>
Also in the proof of 9.30, I was confused for a long time about the proof of commutativity of the square on page 208, but then realised that for an isomorphism, the push-forward is the same as the pull-back by the inverse.
</p></li>

<li>Don&rsquo;t get both remark 9.5.</li>

<li>Curiosity: what happens to the translation non-invariant line bundles under the FM transform?</li>

<li>Can we look at the SL2 action in the case of an elliptic curve?</li>
</ol>
</div>
</div>
<div id="outline-container-org22d73a6" class="outline-2">
<h2 id="org22d73a6">Sections 8.4 and 9.1</h2>
<div class="outline-text-2" id="text-org22d73a6">
<ol class="org-ol">
<li>No need to leave out the proof of 8.42, which follows easily from the isomorphism \(Hom_X(i_*\cal{E},i_*\cal{E})\cong Hom_Y(i^*i_*\cal{E},\cal{E})\).</li>

<li>8.45: I did find a proof, but it wasn&rsquo;t quite so trivial. If someone has an easier argument it would be great to see it.</li>

<li>Don&rsquo;t get both remark 9.5.</li>
</ol>
</div>
</div>
<div id="outline-container-org265ac29" class="outline-2">
<h2 id="org265ac29">Sections 8.2 and 8.3</h2>
<div class="outline-text-2" id="text-org265ac29">
<ol class="org-ol">
<li>Proof of lemma 8.21: Why \(p_* (q^* \epsilon^\vee \otimes S^\vee \otimes \omega_X [dim(X)] \cong Hom(p_*(q^* \epsilon \otimes S), \mathcal{O}_X)\)?</li>

<li>I find the following form of 8.28 easier to understand: Every \(F \in D^b(X)\) has a filtration \[ 0 = F_0 \to F_1 \to \cdots \to F_n = F\] whose &ldquo;subquotients&rdquo; are \(R\pi_*(F(r)) \otimes \Omega^{-r}(-r)\). Likewise, \(F\) also admits a filtration whose &ldquo;subquotients&rdquo; are \(R\pi_* (F \otimes \Omega^{-r}(-r)) \otimes \mathcal O(r)\).</li>

<li>What is the entire section 8.3 doing?</li>

<li>8.30: there&rsquo;s definitely something wrong in the statement, after all the exact sequence \(0\to\Omega(1)\to\cal{O}^{n+1}\to\cal{O}(1)\to0\) gives lots of nonzero maps \(\Omega(1)\to\cal{O}\). 
But no maps from \(\mathcal O \to \Omega(1)\)! So, may be the sequence should be written the other way round?</li>

<li>Esercise 8.5 seems very important; can someone go through or say some words on it?</li>
</ol>
</div>
</div>
<div id="outline-container-org89b1a60" class="outline-2">
<h2 id="org89b1a60">Week 8: Section 8.1</h2>
<div class="outline-text-2" id="text-org89b1a60">
<ol class="org-ol">
<li>Here is an example of Example 8.17: Let \(X\) be a K3 surface. Then \(Y = {\rm Hilb}^n X\) (the Hilbert scheme of \(n\) points on \(X\)) is an algebraic symplectic variety of dimension \(2n\). Suppose we have a \((-2)\) curve \(C \subset X\). Then we have a \(\mathbb P^n \cong  {\rm Hilb^n} C \subset Y\). On \(X\), we have a spherical twist \(D^b(X) \to D^b(X)\) given by \(\mathcal O_C\). On \(Y\), we have a $\mathbb P<sup>n</sup>$-twist \(D^b(Y) \to D^b(Y)\) given by \(\mathcal O_{{\rm Hilb}^n C}\).
<ol class="org-ol">
<li>In general, how you obtain this \((-2)\) curve C? 
In general, there is no such (-2) curve. But some special K3 surfaces may have one. For example, if you move your K3 surface in a family and it acquires a suitable singularity (of type ADE), then its minimal resolution will be a K3 surface that has (-2) curves.</li>
</ol></li>

<li>Proof of 8.6: The first isomorphism is because $\mathcal{O}<sub>&Delta;</sub>$defines an equivalence?</li>

<li>Lemma 8.12 and its Corollary 8.13 are both interesting. Can anyone give more insight by illustrating a nice example?</li>

<li>I don&rsquo;t understand Remark 8.11. Why isn&rsquo;t the inverse given by the adjoint (whose kernel <b>is</b> easily described)?</li>

<li>I couldn&rsquo;t do Exercise 8.7.</li>

<li>I don&rsquo;t understand 8.10ii and 8.10vi</li>

<li>In 8.17, why is H*(X,O<sub>X</sub>)=H*(P<sup>n</sup>) for an algebraic symplectic variety X?</li>
</ol>
</div>
</div>
