content/seminars/dbcoh/index.org
* Week 7: Chapter 7
1. Proof of 7.2, step 4: Does not need the spectral sequence, and is in fact better with top/bottom truncations.
2. Proof of 7.2, step 5: "the map $f \colon x \mapsto \mathcal Q_x$ is injective" and hence "$df$ is injective for $x \in X$ generic". I get what he's trying to do, but what are the source and target of $f$? I think one has to use some kind of Hilbert/Quot scheme here to make sense of the target of $f$.
3. Proof of 7.1, step 3: Why the adjunction morphism delta is not trivial then it is surjective? What does is mean by the kernel of delta is concentrated in k(x)?
4. Remark 7.7: Can anyone explain the first isomorphism relating the hom with Fourier-Mikai transform and homw ith the pull-back of the dualizing kernel?
5. Proof of 7.10: Why can we assume H(F)=0?
6. Why /phi_p is an equivalence implies /phi_P_R = /phi_P_L and then P_R = P_L? Don't understand the argument in Corollary 5.21.
7. If time permits or Anand is happy to help, is it possible to illusrate the construction on the intro of Section 7.3 with a simple example? At least we have an example to keep in mind why goong through the propositions in the section.


* Week 5/6: Sections 5.2, chapter 6
1. In 5.2, is the multiplication by $\sqrt{{\rm td}X}$ just a nice formal trick, or is there a deeper explanation?
    1. This particular term appears in commuting the isomorphisms in between Hochschild cohomology and ordinary cohomology?
    2. I don't really understand how the Todd class behaves with respect to push/pull, products, etc. In particular I don't understand the proof of 5.29.

2. I benefited from doing Exercise 5.34.
    2. Do you mind to share it? :)

3. In Remarks 5.25(ii): why are $\text{CH}(X)$ and $K(X)$ isomorphic after tensoring with $\mathbb Q$?

4. Can someone explain why the proof of Proposition 6.1 has to go by way of Fourier-Mukai kernels? Wouldn't it be simpler to argue that the canonical ring R(X) can be expressed as the graded ring of natural transformations $T^n\to T^{n+k}$, where $T=S[-n]$ with $S$ the Serre functor?

5. If we proceed as in the proof of Proposition 6.1 in the book, what is the composition? How do you compose maps $i_*{\mathcal{O}}_X\to i_*\omega_X^k$ and $i_*\mathcal{O}_X\to i_*\omega_X^\ell$?
    1. You tensor the second factor by an appropriate power of $\omega$. In other words, apply an appropriate power + shift of the Serre functor. This gives a composition $i_*\cal{O_X} \to i_*\omega_X^k \to i_*\omega_X^{k+l}$.

6. The proof of $\pi_X^* \omega_X = \pi_Y^* \omega_Y$ (without the $r$-exponent) on page 149 is only sketched. It'll be nice to talk about it.

7. Any updates on Conjecture 6.24?

8. In Lemma 6.11 and Corollary 6.12 there are some liberties taken. The endomorphism ring is k only if the point is closed, but then the result gets applied to points that decidedly aren't closed.


* Week 4: Sections 4.3 (skim) and 5.1
1. Main ideas
   1. Definition of FM transform
   2. Right/left adjoints
   3. Composition
   4. When is a functor a FM transform
   5. Uniqueness of FM kernel for an equivalence 

2. I don't understand the beginning of the proof of 5.23, specifically "Choosing local sections of $\mathcal P$ shows that there is a morphism $X \to Y$ inducing $f$."

   The argument easily shows that, if $p$ is a closed point of $X\times Y$ and $i:p\to X\times Y$ is the close immersion, then $i^*P$ is either zero or 1 dimemnsional. So the sheaf P is locally generated over $\mathcal{O}_{X\times Y}$ by one generator. And then by pulling to $\{x\}\times Y$ one sees that this generates already over $\mathcal{O}_X$. Flatness over $X$ proves that, in a neighborhood of $(x,f(x))$, $P$ is locally free of rank 1 over $\mathcal{O}_X\subset\mathcal{O}_{X\times Y}$. So locally the picture is $\mathcal{O}_X\subset\mathcal{O}_{X\times Y}\to\frac{\mathcal{O}_{X\times Y}}{\mathcal{I}}$ with the composite an isomorphism.

3. Can someone motivate/explain the rationale of Fourier-Mukai transform by illustrating an interesting example or even few of them? Maybe on K3 surfaces/Calabi-Yau manifold?

4. What does it mean by a saturated derived categories in the paragraph after the proof of Prop 5.9 in pg 117?

* Week 3: Sections 4.1 and 4.2 (and possibly 4.3)

1.  Main ideas
    Broad main idea: Canonically extract an algebra A from the category so that the category is "D^b(mod A)"
   1. The Serre functor is *intrinsic* (commutes with every auto-equivalence). 
   2. Categorical characterisation of points.
      - Funny how it fails to characterise the points when $\omega_X = O_X$ (Exercise 4.4).
   3. Categorical characterisation of line bundles ("dual" to points).
    
2. Can Anand explain further on the second point in his email on Monday using an example?  In fact, can you give a more intutive understanding of O(1) and why we can often look at a shift of it O(-n) ? (Hartshorne's definition of twisting sheaf O(1) seems hard to grasp) I can foresee that this ample line bundle is going to come out in discussions frequently, so it would be better to pin it down ealier than later.

3. Proof of Proposition 4.11. By the time one has proved that $F(k(x))=k(y)$ [middle of page 97], one could also observe that $F$ preserves the t-structure. After all $D^b(X)^{\leq0}$ is the subcategory of all $A$ such that $Hom(A,k(x)[m])=0$ for all closed points $x$ and all $m<0$. It follows that $F$ also preserves the heart of the t-structure. And now the fact that $\omega_Y$ is (anti)-ample is just because there exist epimorphisms from direct sums of $\omega_Y^k$ to arbitrary coherent sheaves $S$. 

4. I am already stuck on Exercise 4.4. Help! (Edit: I got unstuck.)

5. Remark 4.7: Is there a characterisation of point-like objects if the canonical bundle is neither ample nor anti-ample? I ask this question even though Huybrechts asks us later to forget about point-like objects beyond this proof, because the remark is tantalising.

6. Last Friday, Anand talked about Cezh complex. Can someone explain what the the forgetting index do in the coboundary map to make it a chain map?

7. Why the skyscraper sheaf/residue field k(x) tensor with the canonical bundle/dualizing sheaf w_X (this is the canonical n-th differential form line bundle?) is isomorphic to k(x)? Side question: skyscraper sheaf k(x) defined on an open set or just a point x.

8. For lemma 4.5, I can't see where the zero hom condition on negative shifts being used.

9. A structure sheaf is a kind of line bundle?

10. I don't understand the last part of the proof of Proposition 4.6 (which aims to show that the cohomology sheaves are supported in dimension 0.)  In particular, I would like to understand why any point-like object in D^b(X) is of codimension dim(X), as asserted in Remark 4.7


