docs/seminars/dbcoh/index.html
<div id="outline-container-org011dcbe" class="outline-2">
<h2 id="org011dcbe">Week 7: Chapter 7</h2>
<div class="outline-text-2" id="text-org011dcbe">
<ol class="org-ol">
<li>Proof of 7.2, step 4: Does not need the spectral sequence, and is in fact better with top/bottom truncations.</li>
<li>Proof of 7.2, step 5: &ldquo;the map \(f \colon x \mapsto \mathcal Q_x\) is injective&rdquo; and hence &ldquo;\(df\) is injective for \(x \in X\) generic&rdquo;. I get what he&rsquo;s trying to do, but what are the source and target of \(f\)? I think one has to use some kind of Hilbert/Quot scheme here to make sense of the target of \(f\).</li>
<li>Proof of 7.1, step 3: Why the adjunction morphism delta is not trivial then it is surjective? What does is mean by the kernel of delta is concentrated in k(x)?</li>
<li>Remark 7.7: Can anyone explain the first isomorphism relating the hom with Fourier-Mikai transform and homw ith the pull-back of the dualizing kernel?</li>
<li>Proof of 7.10: Why can we assume H(F)=0?</li>
<li>Why /phi<sub>p</sub> is an equivalence implies /phi<sub>P</sub><sub>R</sub> = /phi<sub>P</sub><sub>L</sub> and then P<sub>R</sub> = P<sub>L</sub>? Don&rsquo;t understand the argument in Corollary 5.21.</li>
<li>If time permits or Anand is happy to help, is it possible to illusrate the construction on the intro of Section 7.3 with a simple example? At least we have an example to keep in mind why goong through the propositions in the section.</li>
</ol>
</div>
</div>
<div id="outline-container-org51b9f25" class="outline-2">
<h2 id="org51b9f25">Week 5/6: Sections 5.2, chapter 6</h2>
<div class="outline-text-2" id="text-org51b9f25">
<ol class="org-ol">
<li>In 5.2, is the multiplication by \(\sqrt{{\rm td}X}\) just a nice formal trick, or is there a deeper explanation?
<ol class="org-ol">
<li>This particular term appears in commuting the isomorphisms in between Hochschild cohomology and ordinary cohomology?</li>
<li>I don&rsquo;t really understand how the Todd class behaves with respect to push/pull, products, etc. In particular I don&rsquo;t understand the proof of 5.29.</li>
</ol></li>

<li>I benefited from doing Exercise 5.34.
<ol class="org-ol">
<li>Do you mind to share it? :)</li>
</ol></li>

<li>In Remarks 5.25(ii): why are \(\text{CH}(X)\) and \(K(X)\) isomorphic after tensoring with \(\mathbb Q\)?</li>

<li>Can someone explain why the proof of Proposition 6.1 has to go by way of Fourier-Mukai kernels? Wouldn&rsquo;t it be simpler to argue that the canonical ring R(X) can be expressed as the graded ring of natural transformations \(T^n\to T^{n+k}\), where \(T=S[-n]\) with \(S\) the Serre functor?</li>

<li>If we proceed as in the proof of Proposition 6.1 in the book, what is the composition? How do you compose maps \(i_*{\mathcal{O}}_X\to i_*\omega_X^k\) and \(i_*\mathcal{O}_X\to i_*\omega_X^\ell\)?
<ol class="org-ol">
<li>You tensor the second factor by an appropriate power of \(\omega\). In other words, apply an appropriate power + shift of the Serre functor. This gives a composition \(i_*\cal{O_X} \to i_*\omega_X^k \to i_*\omega_X^{k+l}\).</li>
</ol></li>

<li>The proof of \(\pi_X^* \omega_X = \pi_Y^* \omega_Y\) (without the $r$-exponent) on page 149 is only sketched. It&rsquo;ll be nice to talk about it.</li>

<li>Any updates on Conjecture 6.24?</li>

<li>In Lemma 6.11 and Corollary 6.12 there are some liberties taken. The endomorphism ring is k only if the point is closed, but then the result gets applied to points that decidedly aren&rsquo;t closed.</li>
</ol>
</div>
</div>
<div id="outline-container-org6bd014a" class="outline-2">
<h2 id="org6bd014a">Week 4: Sections 4.3 (skim) and 5.1</h2>
<div class="outline-text-2" id="text-org6bd014a">
<ol class="org-ol">
<li>Main ideas
<ol class="org-ol">
<li>Definition of FM transform</li>
<li>Right/left adjoints</li>
<li>Composition</li>
<li>When is a functor a FM transform</li>
<li>Uniqueness of FM kernel for an equivalence</li>
</ol></li>

<li><p>
I don&rsquo;t understand the beginning of the proof of 5.23, specifically &ldquo;Choosing local sections of \(\mathcal P\) shows that there is a morphism \(X \to Y\) inducing \(f\).&rdquo;
</p>

<p>
The argument easily shows that, if \(p\) is a closed point of \(X\times Y\) and \(i:p\to X\times Y\) is the close immersion, then \(i^*P\) is either zero or 1 dimemnsional. So the sheaf P is locally generated over \(\mathcal{O}_{X\times Y}\) by one generator. And then by pulling to \(\{x\}\times Y\) one sees that this generates already over \(\mathcal{O}_X\). Flatness over \(X\) proves that, in a neighborhood of \((x,f(x))\), \(P\) is locally free of rank 1 over \(\mathcal{O}_X\subset\mathcal{O}_{X\times Y}\). So locally the picture is \(\mathcal{O}_X\subset\mathcal{O}_{X\times Y}\to\frac{\mathcal{O}_{X\times Y}}{\mathcal{I}}\) with the composite an isomorphism.
</p></li>

<li>Can someone motivate/explain the rationale of Fourier-Mukai transform by illustrating an interesting example or even few of them? Maybe on K3 surfaces/Calabi-Yau manifold?</li>

<li>What does it mean by a saturated derived categories in the paragraph after the proof of Prop 5.9 in pg 117?</li>
</ol>
</div>
</div>
<div id="outline-container-org62c81b5" class="outline-2">
<h2 id="org62c81b5">Week 3: Sections 4.1 and 4.2 (and possibly 4.3)</h2>
<div class="outline-text-2" id="text-org62c81b5">
<ol class="org-ol">
<li>Main ideas
Broad main idea: Canonically extract an algebra A from the category so that the category is &ldquo;D<sup>b</sup>(mod A)&rdquo;
<ol class="org-ol">
<li>The Serre functor is <b>intrinsic</b> (commutes with every auto-equivalence).</li>
<li>Categorical characterisation of points.
<ul class="org-ul">
<li>Funny how it fails to characterise the points when \(\omega_X = O_X\) (Exercise 4.4).</li>
</ul></li>
<li>Categorical characterisation of line bundles (&ldquo;dual&rdquo; to points).</li>
</ol></li>

<li>Can Anand explain further on the second point in his email on Monday using an example?  In fact, can you give a more intutive understanding of O(1) and why we can often look at a shift of it O(-n) ? (Hartshorne&rsquo;s definition of twisting sheaf O(1) seems hard to grasp) I can foresee that this ample line bundle is going to come out in discussions frequently, so it would be better to pin it down ealier than later.</li>

<li>Proof of Proposition 4.11. By the time one has proved that \(F(k(x))=k(y)\) [middle of page 97], one could also observe that \(F\) preserves the t-structure. After all \(D^b(X)^{\leq0}\) is the subcategory of all \(A\) such that \(Hom(A,k(x)[m])=0\) for all closed points \(x\) and all \(m<0\). It follows that \(F\) also preserves the heart of the t-structure. And now the fact that \(\omega_Y\) is (anti)-ample is just because there exist epimorphisms from direct sums of \(\omega_Y^k\) to arbitrary coherent sheaves \(S\).</li>

<li>I am already stuck on Exercise 4.4. Help! (Edit: I got unstuck.)</li>

<li>Remark 4.7: Is there a characterisation of point-like objects if the canonical bundle is neither ample nor anti-ample? I ask this question even though Huybrechts asks us later to forget about point-like objects beyond this proof, because the remark is tantalising.</li>

<li>Last Friday, Anand talked about Cezh complex. Can someone explain what the the forgetting index do in the coboundary map to make it a chain map?</li>

<li>Why the skyscraper sheaf/residue field k(x) tensor with the canonical bundle/dualizing sheaf w<sub>X</sub> (this is the canonical n-th differential form line bundle?) is isomorphic to k(x)? Side question: skyscraper sheaf k(x) defined on an open set or just a point x.</li>

<li>For lemma 4.5, I can&rsquo;t see where the zero hom condition on negative shifts being used.</li>

<li>A structure sheaf is a kind of line bundle?</li>

<li>I don&rsquo;t understand the last part of the proof of Proposition 4.6 (which aims to show that the cohomology sheaves are supported in dimension 0.)  In particular, I would like to understand why any point-like object in D<sup>b</sup>(X) is of codimension dim(X), as asserted in Remark 4.7</li>
</ol>
</div>
</div>
