content/seminars/dbcoh/index.org
* Week 2: Chapter 3 
1. Caution about page 75, line 7: If F and E are quasicoherent then the sheaf Hom(F,E) isn't in general quasicoherent. One needs F to be coherent for this to be true. 
    On page 76, the $R\mathcal Hom$ should go from $D^-(Coh X)^{\rm op} \times D^+(QCoh X) \to D^+(QCoh X)$. In general, all the $D^-(Qcoh)$ in this section should be replaced by $D^-(Coh)$ whenever $R\mathcal Hom$ appears.
    
   (i) Can one explain the reason of replacing Qcoh by Coh with some easy examples? These higher functor properties seems hard to digest without examples in mind.

2. Page 83, the proof of Lemma 3.31: I don't see why "Of course, it suffices to show this for $\mathfrak{a}=\mathfrak{m}$." And the case $\mathfrak{a}=\mathfrak{m}$ should be handled more elegantly, just tensor the exact sequence $0\rightarrow \mathfrak{m}\rightarrow A\rightarrow A/\mathfrak{m}\rightarrow 0$ with the module $M$. Anyway: it's better to just appeal to the local criterion of flatness.

3. Proof of 3.17 could be more direct. With the choice of m, we have a map $F^\bullet \to \mathcal H^m[m]$ compose it with a nonzero map $\mathcal H^m[m] \to k(x)[m]$.

4. Is formula (3.18) true (page 85) with $u^*$ and $v^*$ replaced by $Lu^*$ and $Lv^*$ (for arbitrary $u$)?

5. The statement about cohomology and base change needs a flatness hypothesis ($F$ flat over $Y$). Otherwise, it is false.

6. Why is (3.20) equivalent to (3.19) in the section on Grothendieck-Verdier duality?


* Week 1: Section 3.1 + relevant material from Chapter 1 and Chapter 2

 1. Food for thought: what's an example of $A \subset B$ (abelian subcat of an abelian cat) that is *not thick*?

 2. I believe Proposition 2.42 for $D^+$, but why does it also work for $D^b$? Ah! Truncation.

 3. Remark 1.16 reminded me of Ravi Vakil's mnemonic 'RAPL' (Right Adjoints Preserve Limits). This makes sense because both right adjoints and limits are "trying to approximate an object from below."

 4. How do you think about an exact functor $K(A) \to K(B)$? In particular, why is the inner Hom functor exact (page 50)?

 5. The $RHom$ is tricky!

 6. Exercise 2.27 is suspicious: the claimed result does not seem to be true for $K(\mathcal{A})$ precisely because quasi-isomorphisms need not be invertible.

 7. Why doesn't $QCoh(X)$ have enough projectives?

 8. Do projective objects restrict to projective objects on open sets? What about injective objects?

 9. At first glance, Corollary 3.15 appears to be saying that the category $D^b Coh(X)$ is semisimple, but that's of course not true because $Coh(X)$ is already not semisimple. The catch is that being a direct sum of shifts of cohomology objects is a weaker condition than being a direct sum of simple objects. Apparently the correct word to use for the setting of Corollary 3.15 is "formality".

 10. I think the proofs of 3.8, 3.9, 3.10 are good advertisements for the "cohomology filtration" (and foreshadowing a bit, the Harder-Narasimhan filtration). 

 11. In Ex. 2.27, it is stated that short exact sequences in a category A go to distinguished triangles in K(A). But then in the very next line the proof seems to involve the inverse of a quasi - isomorphism which does not make sense in K(A) ?

 12. It is hard for me to grok the universal property of the derived functor. Can someone decipher it for me?

 13. Does $Qcoh(\mathbb A^2 - 0)$ have projectives?

      It doesn't have enough projectives; you can see this because products aren't exact. For each $n>0$ consider on $\mathbb{A}^2$ the map $\cal{O}\oplus\cal{O}\rightarrow\cal{O}$ given by the matrix $(x^n,y^n)$. The restriction to $\mathbb{A}^2-0$ is surjective, but the restriction of the product over $n$ isn't.

